import React from "react";
import { Link } from "react-router-dom";
import logo from "../images/footer-logo.png";
import "../styles/footer.css";

const Footer = () => {
  return (
    <footer className="footer">
      <div className="container">
        <div className="footer-left">
        <Link to="/" className="footer-logo">
          <img src={logo} alt="Community Hub" />
        </Link>
          <p className="footer-description">
            Мы объединяем людей, идеи и бизнесы. Минимум шагов для запуска, максимум времени для общения и взаимодействия!
          </p>
        </div>

        <div className="footer-links">
          <div className="footer-column">
            <Link to="/calendar">Календарь</Link>
            <Link to="/conference">Конференция</Link>
            <Link to="/forum">Бизнес-форум</Link>
            <Link to="/webinar">Вебинар</Link>
            <Link to="/training">Тренинг</Link>
          </div>
          <div className="footer-column">
            <Link to="/blog">Блог</Link>
            <Link to="/news">Новости</Link>
            <Link to="/articles">Статьи</Link>
            <Link to="/candidates">Базы кандидатов</Link>
          </div>
          <div className="footer-column">
            <Link to="/community">Сообщества</Link>
            <Link to="/partners">Партнеры</Link>
            <Link to="/rules">Правила платформы</Link>
            <Link to="/contacts">Контакты</Link>
          </div>
        </div>

        <div className="footer-right">
          <p className="subscribe-text">Подписывайтесь на наши новости:</p>
          <input type="email" placeholder="Введи свой e-mail" className="footer-input" />
          <div className="social-icons">
            <a href="https://https://www.linkedin.com/" target="_blank" rel="noopener noreferrer" className="social-link"><svg width="24" height="24" viewBox="0 0 19 18" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M16.6001 0C17.1305 0 17.6392 0.210714 18.0143 0.585786C18.3894 0.960859 18.6001 1.46957 18.6001 2V16C18.6001 16.5304 18.3894 17.0391 18.0143 17.4142C17.6392 17.7893 17.1305 18 16.6001 18H2.6001C2.06966 18 1.56096 17.7893 1.18588 17.4142C0.810811 17.0391 0.600098 16.5304 0.600098 16V2C0.600098 1.46957 0.810811 0.960859 1.18588 0.585786C1.56096 0.210714 2.06966 0 2.6001 0H16.6001ZM16.1001 15.5V10.2C16.1001 9.33539 15.7566 8.5062 15.1453 7.89483C14.5339 7.28346 13.7047 6.94 12.8401 6.94C11.9901 6.94 11.0001 7.46 10.5201 8.24V7.13H7.7301V15.5H10.5201V10.57C10.5201 9.8 11.1401 9.17 11.9101 9.17C12.2814 9.17 12.6375 9.3175 12.9 9.58005C13.1626 9.8426 13.3101 10.1987 13.3101 10.57V15.5H16.1001ZM4.4801 5.56C4.92566 5.56 5.35298 5.383 5.66804 5.06794C5.9831 4.75288 6.1601 4.32556 6.1601 3.88C6.1601 2.95 5.4101 2.19 4.4801 2.19C4.03188 2.19 3.60202 2.36805 3.28509 2.68499C2.96815 3.00193 2.7901 3.43178 2.7901 3.88C2.7901 4.81 3.5501 5.56 4.4801 5.56ZM5.8701 15.5V7.13H3.1001V15.5H5.8701Z" fill="#FEE719"/>
            </svg>
            </a>
            <a href="https://facebook.com" target="_blank" rel="noopener noreferrer" className="social-link"><svg width="26" height="26" viewBox="0 0 21 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M10.7998 0.0400391C5.2998 0.0400391 0.799805 4.53004 0.799805 10.06C0.799805 15.06 4.4598 19.21 9.2398 19.96V12.96H6.6998V10.06H9.2398V7.85004C9.2398 5.34004 10.7298 3.96004 13.0198 3.96004C14.1098 3.96004 15.2498 4.15004 15.2498 4.15004V6.62004H13.9898C12.7498 6.62004 12.3598 7.39004 12.3598 8.18004V10.06H15.1398L14.6898 12.96H12.3598V19.96C14.7162 19.5879 16.862 18.3856 18.4097 16.5701C19.9575 14.7546 20.8052 12.4457 20.7998 10.06C20.7998 4.53004 16.2998 0.0400391 10.7998 0.0400391Z" fill="#FEE719"/>
            </svg>
            </a>
            <a href="https://instagram.com" target="_blank" rel="noopener noreferrer" className="social-link"><svg width="26" height="26" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M5.8 0H14.2C17.4 0 20 2.6 20 5.8V14.2C20 15.7383 19.3889 17.2135 18.3012 18.3012C17.2135 19.3889 15.7383 20 14.2 20H5.8C2.6 20 0 17.4 0 14.2V5.8C0 4.26174 0.61107 2.78649 1.69878 1.69878C2.78649 0.61107 4.26174 0 5.8 0ZM5.6 2C4.64522 2 3.72955 2.37928 3.05442 3.05442C2.37928 3.72955 2 4.64522 2 5.6V14.4C2 16.39 3.61 18 5.6 18H14.4C15.3548 18 16.2705 17.6207 16.9456 16.9456C17.6207 16.2705 18 15.3548 18 14.4V5.6C18 3.61 16.39 2 14.4 2H5.6ZM15.25 3.5C15.5815 3.5 15.8995 3.6317 16.1339 3.86612C16.3683 4.10054 16.5 4.41848 16.5 4.75C16.5 5.08152 16.3683 5.39946 16.1339 5.63388C15.8995 5.8683 15.5815 6 15.25 6C14.9185 6 14.6005 5.8683 14.3661 5.63388C14.1317 5.39946 14 5.08152 14 4.75C14 4.41848 14.1317 4.10054 14.3661 3.86612C14.6005 3.6317 14.9185 3.5 15.25 3.5ZM10 5C11.3261 5 12.5979 5.52678 13.5355 6.46447C14.4732 7.40215 15 8.67392 15 10C15 11.3261 14.4732 12.5979 13.5355 13.5355C12.5979 14.4732 11.3261 15 10 15C8.67392 15 7.40215 14.4732 6.46447 13.5355C5.52678 12.5979 5 11.3261 5 10C5 8.67392 5.52678 7.40215 6.46447 6.46447C7.40215 5.52678 8.67392 5 10 5ZM10 7C9.20435 7 8.44129 7.31607 7.87868 7.87868C7.31607 8.44129 7 9.20435 7 10C7 10.7956 7.31607 11.5587 7.87868 12.1213C8.44129 12.6839 9.20435 13 10 13C10.7956 13 11.5587 12.6839 12.1213 12.1213C12.6839 11.5587 13 10.7956 13 10C13 9.20435 12.6839 8.44129 12.1213 7.87868C11.5587 7.31607 10.7956 7 10 7Z" fill="#FEE719"/>
            </svg>
            </a>
            <a href="https://web.telegram.org/" target="_blank" rel="noopener noreferrer" className="social-link"><svg width="24" height="20" viewBox="0 0 19 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M6.77998 14.65L7.05998 10.42L14.74 3.49997C15.08 3.18997 14.67 3.03997 14.22 3.30997L4.73998 9.29997L0.639983 7.99997C-0.240017 7.74997 -0.250017 7.13997 0.839983 6.69997L16.81 0.539968C17.54 0.209968 18.24 0.719968 17.96 1.83997L15.24 14.65C15.05 15.56 14.5 15.78 13.74 15.36L9.59998 12.3L7.60998 14.23C7.37998 14.46 7.18998 14.65 6.77998 14.65Z" fill="#FEE719"/>
            </svg>
            </a>
          </div>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
